# YOLOv9s with OBB (Oriented Bounding Box) head
# Identical to yolov9s.yaml except the final Detect layer is replaced with OBB.
# Backbone and neck weights load from yolov9s.pt; the head is re-initialised.

nc: 80  # number of classes (overridden at training time)

# GELAN backbone
backbone:
  - [-1, 1, Conv, [32, 3, 2]]                   # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]                   # 1-P2/4
  - [-1, 1, ELAN1, [64, 64, 32]]                # 2
  - [-1, 1, AConv, [128]]                       # 3-P3/8
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]    # 4
  - [-1, 1, AConv, [192]]                       # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]    # 6
  - [-1, 1, AConv, [256]]                       # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]   # 8
  - [-1, 1, SPPELAN, [256, 128]]                # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]                   # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]    # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]                   # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]    # 15 (P3/8-small)

  - [-1, 1, AConv, [96]]
  - [[-1, 12], 1, Concat, [1]]                  # cat head P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]    # 18 (P4/16-medium)

  - [-1, 1, AConv, [128]]
  - [[-1, 9], 1, Concat, [1]]                   # cat head P5
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]   # 21 (P5/32-large)

  - [[15, 18, 21], 1, OBB, [nc, 1]]             # OBB head (P3, P4, P5); 1 = angle param
